@file:Suppress("UNUSED_PARAMETER")
package lesson1

/**
 * Простая
 *
 * (Модифицированная задача с сайта acmp.ru)
 *
 * Во входном файле с именем inputName содержатся моменты времени в формате ЧЧ:ММ:СС,
 * каждый на отдельной строке. Пример:
 *
 * 13:15:19
 * 07:26:57
 * 10:00:03
 * 19:56:14
 * 13:15:19
 * 00:40:31
 *
 * Отсортировать моменты времени по возрастанию и вывести их в выходной файл с именем outputName,
 * сохраняя формат ЧЧ:ММ:СС. Одинаковые моменты времени выводить друг за другом. Пример:
 *
 * 00:40:31
 * 07:26:57
 * 10:00:03
 * 13:15:19
 * 13:15:19
 * 19:56:14
 *
 * В случае обнаружения неверного формата файла бросить любое исключение.
 */
fun sortTimes(inputName: String, outputName: String) {
    TODO()
}

/**
 * Средняя
 *
 * Во входном файле с именем inputName содержатся фамилии и имена жителей города с указанием улицы и номера дома,
 * где они прописаны. Пример:
 *
 * Петров Иван Железнодорожная 3
 * Сидоров Петр Садовая 5
 * Иванов Алексей Железнодорожная 7
 * Сидорова Мария Садовая 5
 * Иванов Михаил Железнодорожная 7
 *
 * Вывести записи в выходной файл outputName
 * упорядоченными по названию улицы (по алфавиту) и номеру дома (по возрастанию).
 * Людей, живущих в одном доме, выводить через запятую. Пример:
 *
 * Железнодорожная 3 Петров Иван
 * Железнодорожная 7 Иванов Алексей, Иванов Михаил
 * Садовая 5 Сидорова Мария, Сидоров Петр
 */
fun sortPeople(inputName: String, outputName: String) {
    TODO()
}

/**
 * Сортировать температуры с десятыми
 */
fun sortTemperatures(inputName: String, outputName: String) {
    TODO()
}

/**
 * Преобразование последовательности
 */
fun sortSequence(inputName: String, outputName: String) {
    TODO()
}

